<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GradeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('grades')->insert([
            ['name' => 'الأول الابتدائي'],
            ['name' => 'الثاني الابتدائي'],
            ['name' => 'الثالث الابتدائي'],
            ['name' => 'الرابع الابتدائي'],
            ['name' => 'الخامس الابتدائي'],
            ['name' => 'السادس الابتدائي'],
            ['name' => 'السابع'],
            ['name' => 'الثامن'],
            ['name' => 'التاسع'],
            ['name' => 'الأول الثانوي'],
            ['name' => 'الثاني الثانوي'],
            ['name' => 'الثالث الثانوي'],
        ]);
    }
}


/*
قم بادراج سيدر مناسب بحسب المعلومات التالية بحسب كل جدول بحيث المصطلحات الانجليزي تشير الى اسماء الجداول في قاعدة البيانات:
// مرحلة الطفولة المبكرة    --هنا المرحلة --school_stages
//رياض الاطفال       --grades--
//اضف ثلاثة كتب افتراضية   --courses--
//المرحلة الابتدائية     --school_stages--
//الصف الاول ,الصف الثاني     grades
//قران, اسلامية, لغة عربية ,رياضيات ,علوم     courses
//الصف الثالث والرابع    grades
////قران ,اسلامية ,لغة عربية, رياضيات ,علوم تربية ,تربية اجتماعية    courses
//الصف الخامس والسادس     grades
//////قران ,اسلامية ,لغة, عربية ,رياضيات ,علوم ,اجتماعيات(تاريخ,جغرافيا,تربية وطنية)    courses
//الصف السابع والصف الثامن والصف التاسع    grades
//////قران, اسلامية ,لغة عربية ,رياضيات ,علوم, اجتماعيات(تاريخ,جغرافيا,تربية وطنية) , انجليزي    courses
//المرحلة الثانوية     school_stages
// الصف الاول الثانوي الصف الثاني الثانوي الصف الثالث الثانوي    grades
//////// قران, اسلامية (حديث , فقه ,سيرة نبوية,الايمان,) ,لغة عربية(القراءة, الادب والنصوص والبلاغة,النحو والصرف),رياضيات ,كيمياء ,فيزياء, أحياء ,اجتماعيات(تاريخ,جغرافيا, المجتمع اليمني)  انجليزي الحاسوب     courses


*/


